Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: List of Function Aliases
pt_br: Lista de funções sinônimas (aliases)

source: All functions look like this:
pt_br: Extending PHP

source: void php3_foo( INTERNAL_FUNCTION_PARAMETERS) {}
pt_br: Function Prototype

source: Example E-1.
pt_br: Exemplo E-1.

source: If you change the string of a parameter which already IS_STRING or IS_ARRAY you should run pval_destructor on it first.
pt_br: Variable Function Arguments

source: Example E-2.
pt_br: Exemplo E-2.

source: pval *arg1, *arg2, *arg3; int arg_count = ARG_COUNT(ht); if (arg_count 2 _BAR_ _BAR_ arg_count 3 _BAR_ _BAR_ getParameters(ht,arg_count, arg1, arg2, arg3)==FAILURE) {WRONG_PARAM_COUNT;}
pt_br: Using the Function Arguments

source: Table E-1.
pt_br: Tabela E-1.

source: If you compile with "-DDEBUG", PHP will print out a list of all memory that was allocated using emalloc() and estrdup() but never freed with efree() when it is done running the specified script.
pt_br: Setting Variables in the Symbol Table

source: Example E-3.
pt_br: Exemplo E-3.

source: Example E-4.
pt_br: Exemplo E-4.

source: Example E-5.
pt_br: Exemplo E-5.

source: Example E-6.
pt_br: Exemplo E-6.

source: Just about any hash function returns SUCCESS or FAILURE (except for hash_exists(), which returns a boolean truth value).
pt_br: Returning simple values

source: If your function returns boolean success / error responses, always use RETURN_TRUE and RETURN_FALSE respectively.
pt_br: Returning complex values

source: add_next_index_stringl( return_value,str,length) - specify the string length
pt_br: Using the resource list

source: Example E-7.
pt_br: Exemplo E-7.

source: Example E-8.
pt_br: Exemplo E-8.

source: Example E-9.
pt_br: Exemplo E-9.

source: pval *resource_id; RESOURCE *resource; int type; convert_to_long(resource_id); php3_list_delete(resource_id - value.lval);
pt_br: Using the persistent resource table

source: Many of the features of PHP can be configured at runtime.
pt_br: Adding runtime configuration directives

source: Debugger Protocol
pt_br: Protocolo do Debugger

source: PHP, which stands for "PHP:
pt_br: PHP, que significa "PHP:

source: Hypertext Preprocessor "is a widely-used Open Source general-purpose scripting language that is especially suited for Web development and can be embedded into HTML.
pt_br: Hypertext Preprocessor ", é uma linguagem de programação de ampla utilização, interpretada, que é especialmente interessante para desenvolvimento para a Web e pode ser mesclada dentro do código HTML.

source: Its syntax draws upon C, Java, and Perl, and is easy to learn.
pt_br: A sintaxe da linguagem lembra C, Java e Perl, e é fácil de aprender.

source: The main goal of the language is to allow web developers to write dynamically generated webpages quickly, but you can do much more with PHP.
pt_br: O objetivo principal da linguagem é permitir a desenvolvedores escrever páginas que serão geradas dinamicamente rapidamente, mas você pode fazer muito mais do que isso com PHP.

source: This manual consists primarily of a function reference, but also contains a language reference, explanations of some of PHP 's major features, and other supplemental information.
pt_br: Esse manual consiste primariamente de uma referência de funções, mas ele também contém uma referência da linguagem, explicações sobre as mais importantes características do PHP, e outras informações suplementares.

source: You can download this manual in several formats at http: / /www.php.net / docs.php.
pt_br: Você pode fazer o download desse manual em vários formatos em http: / /www.php.net / docs.php.

source: The downloads are updated as the content changes.
pt_br: Os arquivos para downloads são atualizados automaticamente assim que o conteúdo for modificado.

source: More information about how this manual is developed can be found in the 'About the manual' appendix.
pt_br: Para mais informações sobre como esse manual é desenvolvido pode ser encontrado em 'Sobre o manual' do apêndice.

source: See also PHP History
pt_br: Veja também a história do PHP.

source: These functions are only available when running PHP as an Apache 1.x module.
pt_br: Introdução

source: For PHP installation on Apache 1.x see the Apache section in the installation chapter.
pt_br: Instalação

source: The behaviour of the Apache PHP module is affected by settings in php.ini.
pt_br: Configuração durante execução

source: Configuration settings from php.ini may be overridden by php_flag settings in the server configuration file or local .htaccess files.
pt_br: As diretivas de configuração no php.ini podem ser sobrescritas por diretivas php_flag no arquivo de configuração do servidor ou por arquivos .htaccess locais.

source: Turning off PHP parsing for a directory using .htaccess
pt_br: Desligando a interpretação do PHP em um diretório com o .htaccess

source: Apache configuration options
pt_br: Opções de configuração no Apache

source: Function
pt_br: Descrição

source: turns PHP parsing on or off
pt_br: liga ou desliga a interpretação pelo PHP

source: specify whether PHP scripts may request child process termination on end of request, see also apache_child_terminate()
pt_br: Detalhes na função apache_child_terminate()

source: send PHP scripts modification date as Last-Modified: header for this request
pt_br: envia a data de modificação do script PHP como um header Last-Modified:

source: parse files with executable bit set as PHP regardles of their file ending
pt_br: interpreta arquivos marcados executáveis como scripts PHP, independentemente do final do arquivo

source: This directive is really only useful in the Apache module version of PHP.
pt_br: Esta diretiva somente é útil para a versão módulo do Apache do PHP.

source: It is used by sites that would like to turn PHP parsing on and off on a per-directory or per-virtual server basis.
pt_br: Ela pode ser usada para ligar ou desligar a interpretação do PHP em nível de diretório ou em nível de servidor virtual.

source: By putting engine off in the appropriate places in the httpd.conf file, PHP can be enabled or disabled.
pt_br: Tipos Resource

source: This extension has no resource types defined.
pt_br: Constantes Predefinidas

source: This extension has no constants defined.
pt_br: Esta extensão não possui nenhuma constante.

source: These functions allow you to interact with and manipulate arrays in various ways.
pt_br: Funções para manipulação de arrays

source: Arrays are essential for storing, managing, and operating on sets of variables.
pt_br: Essas funções permitem a interação e manipulação de arrays de várias formas.

source: Simple and multi-dimensional arrays are supported, and may be either user created or created by another function.
pt_br: Arrays simples e multidimensionais (matrizes) são suportados, e podem ser criados pelo usuário ou por outras funções.

source: There are specific database handling functions for populating arrays from database queries, and several functions return arrays.
pt_br: Existem diversas funções específicas para bancos de dados para preencher arrays com os dados retornados em consultas, e vários outros tipos de funções também retornam arrays.

source: No external libraries are needed to build this extension.
pt_br: Instalação

source: There is no installation needed to use these functions; they are part of the PHP core.
pt_br: Configuração durante execução

source: This extension has no configuration directives defined in php.ini.
pt_br: Tipos Resource

source: The constants below are always available as part of the PHP core.
pt_br: As constantes listadas abaixo estão sempre disponíveis como parte do núcleo do PHP.

source: CASE_LOWER is used with array_change_key_case() and is used to convert array keys to lower case.
pt_br: CASE_LOWER é usada com a função array_change_key_case() e é usada em chaves de arrays para torná-las minúsculas.

source: This is also the default case for array_change_key_case().
pt_br: É o valor padrão utilizado em array_change_key_case().

source: CASE_UPPER is used with array_change_key_case() and is used to convert array keys to upper case.
pt_br: CASE_UPPER é usada com a função array_change_key_case() e é usada em chaves de arrays para torná-las maiúsculas.

source: SORT_ASC is used with array_multisort() to sort in ascending order.
pt_br: SORT_ASC é usada com array_multisort() para ordenar em ordem crescente.

source: SORT_DESC is used with array_multisort() to sort in descending order.
pt_br: SORT_DESC é usada com array_multisort() para ordenar em ordem descrescente

source: Sorting type flags: used by various sort functions
pt_br: Sinais de tipos de ordenação: usadas por várias funções de ordenação

source: SORT_REGULAR is used to compare items normally.
pt_br: SORT_REGULAR é usada para comparar itens normalmente.

source: SORT_NUMERIC is used to compare items numerically.
pt_br: SORT_NUMERIC é usada para comparar itens numericamente.

source: SORT_STRING is used to compare items as strings.
pt_br: SORT_STRING é usada para comparar itens como se fossem strings.

source: See also is_array(), explode(), implode(), split(), preg_split(), and join().
pt_br: Veja também is_array(), explode(), implode(), split(), preg_split() e join().

source: The aspell() functions allows you to check the spelling on a word and offer suggestions.
pt_br: Aspell functions [deprecated]

source: It uses pspell library and works with newer versions of aspell.
pt_br: Instalação

source: You need the aspell library, available from: http: / /aspell.sourceforge.net /.
pt_br: Veja Também

source: For arbitrary precision mathematics PHP offers the Binary Calculator which supports numbers of any size and precision, represented as strings.
pt_br: BCMath Funções Matemáticas de Precisão Arbitrária

source: You don 't need any external libraries for this extension.
pt_br: Para matemática de precisão arbitrária, o PHP oferece a Calculadora Binária com suporte a números de qualquer tamanho e precisão, representados como strings.

source: In PHP 4, these functions are only available if PHP was configured with --enable-bcmath.
pt_br: Desde o PHP 4.0.4, a libbcmath é distribuída junto com o PHP.

source: In PHP 3, these functions are only available if PHP was NOT configured with --disable-bcmath.
pt_br: Instalação

source: The windows version of PHP The windows version of PHP has built in support for this extension.
pt_br: No PHP 4, estas funções somente serão disponíveis se PHP foi configurado com --enable-bcmath.

source: You do not need to load any additional extension in order to use these functions.
pt_br: Configuração durante execução

source: The behaviour of these functions is affected by settings in php.ini.
pt_br: O comportamento dessas funções podem ser modificado pelas configurações do php.ini.

source: BC math configuration options
pt_br: Opções de configuração da BC Math

source: Number of decimal digits for all bcmath functions.
pt_br: Tipos Resource

source: The bzip2 functions are used to transparently read and write bzip2 (.bz2) compressed files.
pt_br: Funções de compactação com Bzip2

source: This module uses the functions of the bzip2 library by Julian Seward.
pt_br: As funções para bzip2 são usadas para ler e escrever, de forma transparente, arquivos compactados do tipo bzip2 (.bz2).

source: This module requires bzip2 / libbzip2 version = 1.0.x.
pt_br: Este módulo utiliza as funções da biblioteca bzip2 desenvolvida por Julian Seward

source: Bzip2 support in PHP is not enabled by default.
pt_br: O suporte às funções para Bzip2 no PHP não é habilitado por padrão.

source: You will need to use the --with-bz2[ =DIR] configuration option when compiling PHP to enable bzip2 support.
pt_br: Este módulo requer bzip2 / libbzip2, versão = 1.0.x.

source: This extension defines one resource type: a file pointer identifying the bz2-file to work on.
pt_br: Esta extensão define um tipo de recurso (resource): um ponteiro para arquivo que identifica o arquivo bzip2 que está sendo usado.

source: This example opens a temporary file and writes a test string to it, then prints out the contents of the file.
pt_br: Este exemplo abre um arquivo temporário e escreve uma string de test nele, e então mostra o conteúdo do arquivo.

source: Small bzip2 Example
pt_br: Um exemplo simples de bzip2

source: ?php $filename = "/ tmp / testfile.bz2"; $str = "This is a test string.\n"; / / open file for writing $bz = bzopen($filename, "w"); / / write string to file bzwrite($bz, $str); / / close file bzclose($bz); / / open file for reading $bz = bzopen($filename, "r"); / / read 10 characters print bzread($bz, 10); / / output until end of the file (or the next 1024 char) and close it. print bzread($bz); bzclose($bz);?
pt_br: ?php $arquivo = "/ tmp / testfile.bz2"; $str = "This is a test string.\n"; / / abre o arquivo para escrita $bz = bzopen($arquivo, "w"); / / escreve a string no arquivo bzwrite($bz, $str); / / fecha o arquivo bzclose($bz); / / abre o arquivo para leitura $bz = bzopen($arquivo, "r"); / / lê 10 caracteres print bzread($bz, 10); / / imprime até o final do arquivo (ou os próximos 1024 caracteres) print bzread($bz); / / fecha o arquivo bzclose($bz);?

source: The constants below are defined by this extension, and will only be available when the extension has either been compiled into PHP or dynamically loaded at runtime.
pt_br: As contantes abaixo são definidas por esta extensão e somente estarão disponíveis quando a extensão foi compilada com o PHP ou carregada dinamicamente durante a execução.

source: These functions interface the CCVS API, allowing you to work directly with CCVS from your PHP scripts.
pt_br: CCVS API Functions

source: You will also need to make sure the PHP Processes are running under the same user as your CCVS was installed as (e.g. if you installed CCVS as user'ccvs', your PHP processes must run as'ccvs' as well.)
pt_br: Veja Também

source: These functions allow you to obtain information about classes and instance objects.
pt_br: Classes e Objetos

source: You can obtain the name of the class to which a object belongs, as well as its member properties and methods.
pt_br: Introdução

source: In this example, we first define a base class and an extension of the class.
pt_br: Neste exemplo, nós primeiramente definiremos uma classe base e uma extensão da classe.

source: The base class describes a general vegetable, whether it is edible or not and what is its color.
pt_br: A classe base descreve um vegetal comum, que é comestível ou não e que tem sua cor.

source: The subclass Spinach adds a method to cook it and another to find out if it is cooked.
pt_br: A sub-classe Espinafre adiciona um método para cozinhá-lo e outro para descobrir se ele está cozido.

source: Example 1. classes.inc
pt_br: Exemplo 1. classes.inc

source: We then instantiate 2 objects from these classes and print out information about them, including their class parentage.
pt_br: Nós instânciamos 2 objetos destas classes e exibimos informações sobre elas, incluindo o parentesco de suas classes.

source: We also define some utility functions, mainly to have a nice printout of the variables.
pt_br: Nós também definimos algumas funções úteis, principalmente ter uma boa saída de variáveis.

source: Example 2. test_script.php
pt_br: Exemplo 2. test_script.php

source: One important thing to note in the example above is that the object $leafy is an instance of the class Spinach which is a subclass of Vegetable, therefore the last part of the script above will output:
pt_br: Uma coisa importante para notar no exemplo acima é que o objeto $leafy é uma instância da classe Espinafre que é uma subclasse de Vegetal, então a última parte do script acima retornará:

source: COM encourages versioning, separation of implementation from interface and hiding the implementation details such as executable location and the language it was written in.
pt_br: Requisitos

source: COM functions are only available on the Windows version of PHP.
pt_br: Instalação

source: ClibPDF lets you create PDF documents with PHP.
pt_br: ClibPDF functions

source: To do so add to your configure line the options --with-jpeg-dir[ =DIR] --with-tiff-dir[=DIR].
pt_br: Configuração durante execução

source: Simple ClibPDF Example
pt_br: Exemplo 1.

source: Example 2. pdfclock example from pdflib 2.0 distribution
pt_br: Exemplo 2. pdfclock example from pdflib 2.0 distribution

source: ?php $radius = 200; $margin = 20; $pagecount = 40; $pdf = cpdf_open(0); cpdf_set_creator($pdf, "pdf_clock.php3"); cpdf_set_title($pdf, "Analog Clock"); while($pagecount- - 0) {cpdf_page_init($pdf, $pagecount+1, 0, 2 * ($radius + $margin), 2 * ($radius + $margin), 1.0); cpdf_set_page_animation($pdf, 4, 0.5, 0, 0, 0); / * wipe * / cpdf_translate($pdf, $radius + $margin, $radius + $margin); cpdf_save($pdf); cpdf_setrgbcolor($pdf, 0.0, 0.0, 1.0); / * minute strokes * / cpdf_setlinewidth($pdf, 2.0); for ($alpha = 0; $alpha 360; $alpha += 6) {cpdf_rotate($pdf, 6.0); cpdf_moveto($pdf, $radius, 0.0); cpdf_lineto($pdf, $radius-$margin / 3, 0.0); cpdf_stroke($pdf);} cpdf_restore($pdf); cpdf_save($pdf); / * 5 minute strokes * / cpdf_setlinewidth($pdf, 3.0); for ($alpha = 0; $alpha 360; $alpha += 30) {cpdf_rotate($pdf, 30.0); cpdf_moveto($pdf, $radius, 0.0); cpdf_lineto($pdf, $radius-$margin, 0.0); cpdf_stroke($pdf);} $ltime = getdate(); / * draw hour hand * / cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['minutes'] / 60.0) + $ltime['hours'] - 3.0) * 30.0); cpdf_moveto($pdf, -$radius / 10, -$radius / 20); cpdf_lineto($pdf, $radius / 2, 0.0); cpdf_lineto($pdf, -$radius / 10, $radius / 20); cpdf_closepath($pdf); cpdf_fill($pdf); cpdf_restore($pdf); / * draw minute hand * / cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['seconds'] / 60.0) + $ltime['minutes'] - 15.0) * 6.0); cpdf_moveto($pdf, -$radius / 10, -$radius / 20); cpdf_lineto($pdf, $radius * 0.8, 0.0); cpdf_lineto($pdf, -$radius / 10, $radius / 20); cpdf_closepath($pdf); cpdf_fill($pdf); cpdf_restore($pdf); / * draw second hand * / cpdf_setrgbcolor($pdf, 1.0, 0.0, 0.0); cpdf_setlinewidth($pdf, 2); cpdf_save($pdf); cpdf_rotate($pdf, -(($ltime['seconds'] - 15.0) * 6.0)); cpdf_moveto($pdf, -$radius / 5, 0.0); cpdf_lineto($pdf, $radius, 0.0); cpdf_stroke($pdf); cpdf_restore($pdf); / * draw little circle at center * / cpdf_circle($pdf, 0, 0, $radius / 30); cpdf_fill($pdf); cpdf_restore($pdf); cpdf_finalize_page($pdf, $pagecount+1);} cpdf_finalize($pdf); Header("Content-type: application / pdf"); cpdf_output_buffer($pdf); cpdf_close($pdf);?
pt_br: Veja Também

source: These functions allow you to use the CrackLib library to test the 'strength' of a password.
pt_br: Introdução

source: CrackLib will also give helpful diagnostic messages that will help 'strengthen' the password.
pt_br: Requisitos

source: More information regarding CrackLib along with the library can be found at http: / /www.users.dircon.co.uk / ~crypto /.
pt_br: Instalação

source: In order to use these functions, you must compile PHP with Crack support by using the --with-crack[ =DIR] option.
pt_br: Configuração durante execução

source: Passing anything else but a string or integer will return FALSE immediately.
pt_br: Requisitos

source: None besides functions from the standard C library which are always available.
pt_br: Instalação

source: Builtin support for ctype is available with PHP 4.3.0.
pt_br: Configuração durante execução

source: C:\WINNT\SYSTEM32 or C:\WINDOWS\SYSTEM32)
pt_br: Constantes Predefinidas

source: These functions are only available if the interpreter has been compiled with the --with-cybercash=[ DIR].
pt_br: Instalação

source: This extension is not available on Windows platforms.
pt_br: Nota:

source: These functions allow you to get the date and time from the server where your PHP scripts are running.
pt_br: Funções data e hora

source: You can use these functions to format the date and time in many different ways.
pt_br: Você pode usar estas funções para tratar com a data e a hora.

source: Please keep in mind that these functions are dependent on the locale settings of your server.
pt_br: Nota:

source: Make sure to take daylight saving time and leap years into consideration when working with these functions.
pt_br: Considerar especialmente horário-de-verão e anos bissextos.

source: These functions build the foundation for accessing Berkeley DB style databases.
pt_br: Database (dbm-style) abstraction layer functions

source: Note: db2 conflicts with db3 and db4.
pt_br: Nota: db2 conflicts with db3 and db4.

source: Note: db3 conflicts with db2 and db4.
pt_br: Nota: db3 conflicts with db2 and db4.

source: Note: db4 conflicts with db2 and db3.
pt_br: Nota: db4 conflicts with db2 and db3.

source: Starting with PHP 5.0.0 there is a configuration check avoid such missconfigurations.
pt_br: Configuração durante execução

source: The functions dba_open() and dba_popen() return a handle to the specified database file to access which is used by all other dba-function calls.
pt_br: Constantes Predefinidas

source: DBA example
pt_br: Exemplo 1.

source: These functions allow you to access records stored in dBase-format (dbf) databases.
pt_br: Introdução

source: Choose any real SQL server instead; MySQL or Postgres are common choices with PHP. dBase support is here to allow you to import and export data to and from your web database, because the file format is commonly understood by Windows spreadsheets and organizers.
pt_br: Instalação

source: In order to enable the bundled dbase library and to use these functions, you must compile PHP with the --enable-dbase option.
pt_br: Configuração durante execução

source: These functions allow you to store records stored in a dbm-style database.
pt_br: Introdução

source: However, dbm support is deprecated and you are encourged to use the Database (dbm-style) abstraction layer functions instead.
pt_br: Requisitos

source: In addition you must ensure support for an underlying database or you can use some sytem libraries.
pt_br: Configuração durante execução

source: The function dbmopen() returns an database identifier which is used by the other dbm-functions.
pt_br: Constantes Predefinidas

source: DBM example
pt_br: Exemplo 1.

source: This extension is EXPERIMENTAL.
pt_br: Atenção

source: The behaviour of this extension - - including the names of its functions and anything else documented about this extension - - may change without notice in a future release of PHP.
pt_br: Isso quer dizer que o comportamento neste módulo -- - incluindo suas funções e seus nomes, e TUDO mais que está documentado sobre esse módulo -- - poderá mudar em futuras versões do PHP, SEM QUALQUER NOTIFICAÇÃO.

source: Use this extension at your own risk.
pt_br: Esteja avisado, e use este módulo por sua própria conta e risco.

source: Concept asa always had an interest in supporting open source languages, db+ + has had Perl and Tcl call interfaces for years now and uses Tcl as its internal stored procedure language.
pt_br: Requisitos

source: If you have installed db+ + in a different place you have add the installation path to the configure option like this: --with-dbplus= / your / installation / path.
pt_br: Configuração durante execução

source: A dbplus_relation is a handle to a stored relation or a relation generated as the result of a query.
pt_br: Constantes Predefinidas

source: The dbx module is a database abstraction layer (db'X', where'X 'is a supported database).
pt_br: Introdução

source: To get other supported databases to work with the dbx-module refer to their specific documentation.
pt_br: Configuração durante execução

source: This directive can be overridden with a flag to dbx_query().
pt_br: Tipos Resource

source: To get these functions to work, you have to configure PHP with --enable-dio.
pt_br: Configuração durante execução
